In [1]:
# import library
import mysql.connector
# import pandas as pd
print("Success fully import library")

Success fully import library

In [2]:
# MySQL connection build
conn = mysql.connector.connect(
    host = "localhost",
    user = "root",
    password = "1234",
    # database = "new_database"
    database = "school"
)
cursor = conn.cursor()
print("database successfully connect")

database successfully connect

# Q.1 Create a database named schoo

In [9]:
query = "create database new_database2"
cursor.execute(query)
print("Create successfully database")

Create successfully database

# Q.2 Create a table students with columns: id, name, age, class, marks.

In [19]:
query = """
        create table new_table (
        id int primary key auto_increment,
        name varchar(150)  not null,
        age int not null,
        class varchar(100) not null,
        marks int not null
     )
"""
cursor.execute(query)
print("Create Successfully table")

Create Successfully table

# Q.3 Insert 5 records into students table.

In [32]:
query = """
      insert into new_table(name,age,class,marks) value("rohan",22,"BCA",95),
                                                         ("mohit",21,"MCA",75),
                                                         ("radhika",24,"BSC",90),
                                                         ("monika",21,"BCA",85),
                                                         ("rohan",25,"BCA",55),
                                                         ("kuldeep",26,"MCA",60)
"""
cursor.execute(query)
conn.commit()
print("Success fully insert data in Mysql Table")

Success fully insert data in Mysql Table

# Q.4 Show all records from students table

In [17]:
query = "select * from new_database.new_table"
cursor.execute(query)
data  = cursor.fetchall()

for i in data:
    print(i)
print("all data print")

(12, 'rohan', 22, 'BCA', 95)
(13, 'mohit', 21, 'MCA', 75)
(14, 'radhika', 24, 'BSC', 90)
(15, 'monika', 21, 'BCA', 85)
(16, 'rohan', 25, 'BCA', 55)
(17, 'kuldeep', 26, 'MCA', 60)
(18, 'ram singh', 23, 'BSC', 70)
(19, 'rahul kumar', 22, 'BSC', 65)
(20, 'rohan singh', 27, 'MCA', 80)
(21, 'Asim kumar', 24, 'BCA', 91)
(22, 'lave kumar', 29, 'BSC', 81)
(23, 'rohan', 22, 'BCA', 95)
(24, 'mohit', 21, 'MCA', 75)
(25, 'radhika', 24, 'BSC', 90)
(26, 'monika', 21, 'BCA', 85)
(27, 'rohan', 25, 'BCA', 55)
(28, 'kuldeep', 26, 'MCA', 60)
(29, 'rohan', 22, 'BCA', 95)
(30, 'mohit', 21, 'MCA', 75)
(31, 'radhika', 24, 'BSC', 90)
(32, 'monika', 21, 'BCA', 85)
(33, 'rohan', 25, 'BCA', 55)
(34, 'kuldeep', 26, 'MCA', 60)
all data print

In [20]:
query = "select * from school.students"
cursor.execute(query)

data = cursor.fetchall()
for i in data:
    print(i)

(1, 'shivem', 1, 98)
(2, 'ritem', 1, 95)
(3, 'Atif', 2, 100)
(4, 'Nazem', 3, 81)
(5, 'noor', 1, 95)
(6, 'Gorab', 2, 68)
(7, 'Prikhar', 2, 50)
(8, 'bhupas', 3, 96)
(9, 'Asim', 1, 78)
(10, 'rajkumar', 3, 98)

# Q.5 Display only name and marks of students.

In [22]:
query = "select student_name, marks from school.students"
cursor.execute(query)

data = cursor.fetchall()
for i in data:
    print(i)

('shivem', 98)
('ritem', 95)
('Atif', 100)
('Nazem', 81)
('noor', 95)
('Gorab', 68)
('Prikhar', 50)
('bhupas', 96)
('Asim', 78)
('rajkumar', 98)

# Q.6 Show students whose age is greater than 15.

In [39]:
query = "select age from school.new_table where age > 15"
cursor.execute(query)

data = cursor.fetchall()
for i in data:
    print(i)

(22,)
(21,)
(24,)
(21,)
(25,)
(26,)

# Q.7 Show students who have marks more than 80.

In [40]:
query = "select * from school.students where marks > 80"
cursor.execute(query)

data = cursor.fetchall()
for i in data:
    print(i)

(1, 'shivem', 1, 98)
(2, 'ritem', 1, 95)
(3, 'Atif', 2, 100)
(4, 'Nazem', 3, 81)
(5, 'noor', 1, 95)
(8, 'bhupas', 3, 96)
(10, 'rajkumar', 3, 98)

# Q.8 Show all students in ascending order of marks.

In [42]:
query = "select * from school.students order by marks asc"
cursor.execute(query)

data = cursor.fetchall()
for i in data:
    print(i)

(7, 'Prikhar', 2, 50)
(6, 'Gorab', 2, 68)
(9, 'Asim', 1, 78)
(4, 'Nazem', 3, 81)
(2, 'ritem', 1, 95)
(5, 'noor', 1, 95)
(8, 'bhupas', 3, 96)
(1, 'shivem', 1, 98)
(10, 'rajkumar', 3, 98)
(3, 'Atif', 2, 100)

# Q.9 Show all students in descending order of age.

In [45]:
query = "select * from school.students order by marks desc"
cursor.execute(query)

data = cursor.fetchall()
for i in data:
    print(i)

(3, 'Atif', 2, 100)
(1, 'shivem', 1, 98)
(10, 'rajkumar', 3, 98)
(8, 'bhupas', 3, 96)
(2, 'ritem', 1, 95)
(5, 'noor', 1, 95)
(4, 'Nazem', 3, 81)
(9, 'Asim', 1, 78)
(6, 'Gorab', 2, 68)
(7, 'Prikhar', 2, 50)

# Q.10 Count total number of students in the table.

In [47]:
query  = "select count(student_id) as total_student from school.students"
cursor.execute(query)

data = cursor.fetchall()
for i in data:
    print("Total students in class ",i)

Total students in class  (10,)

# Q.11 Show students with marks between 50 and 80.

In [52]:
# query = "select * from school.students where marks >= 50 and marks <= 80"
query = "select * from school.students where marks between 50 and 80"
cursor.execute(query)

data = cursor.fetchall()
for i in data:
    print(i)

(6, 'Gorab', 2, 68)
(7, 'Prikhar', 2, 50)
(9, 'Asim', 1, 78)

# Q.12 Show students who are in class 8C

In [54]:
query = """
        select students.student_name, classes.class_name from school.students join school.classes 
        on students.class_id = classes.class_id where class_name = "class 8C"
"""
cursor.execute(query)

data = cursor.fetchall()
for i in data:
    print(i)

('Nazem', 'class 8C')
('bhupas', 'class 8C')
('rajkumar', 'class 8C')

# Q.13 Show students whose name starts with "A".

In [56]:
query = "select * from school.students where student_name like 'a%'"
cursor.execute(query)

data = cursor.fetchall()
for i in data:
    print(i)

(3, 'Atif', 2, 100)
(9, 'Asim', 1, 78)

# Q.14 Show students whose name ends with "m".

In [58]:
query = "select * from school.students where student_name like '%m'"
cursor.execute(query)

data = cursor.fetchall()
for i in data:
    print(i)

(1, 'shivem', 1, 98)
(2, 'ritem', 1, 95)
(4, 'Nazem', 3, 81)
(9, 'Asim', 1, 78)

# Q.15 Show students whose name contains "oo".

In [60]:
query = "select * from school.students where student_name like '%oo%'"
cursor.execute(query)

data = cursor.fetchall()
for i in data:
    print(i)

(5, 'noor', 1, 95)

# Q.16 Show students who do not belong to class 8C.

In [65]:
query = """
      select students.student_name, classes.class_name from school.students
      join school.classes
      on students.class_id = classes.class_id
      where class_name != 'Class 8C'
"""
cursor.execute(query)

data = cursor.fetchall()
for i in data:
    print(i)

('shivem', 'class 6A')
('ritem', 'class 6A')
('noor', 'class 6A')
('Asim', 'class 6A')
('Atif', 'class 7B')
('Gorab', 'class 7B')
('Prikhar', 'class 7B')

# Q.17 Show students who are either in class 7B or class 8C.

In [67]:
query = """
       select students.student_name, classes.class_name 
       from school.students
       join school.classes
       on students.class_id = classes.class_id
       where class_name in ('class 7B','class 8C')
"""
cursor.execute(query)

data = cursor.fetchall()
for i in data:
    print(i)

('Atif', 'class 7B')
('Gorab', 'class 7B')
('Prikhar', 'class 7B')
('Nazem', 'class 8C')
('bhupas', 'class 8C')
('rajkumar', 'class 8C')

# Q.18 Find the maximum marks in the table.

In [71]:
query = """
      select * from school.students
      where marks = (
          select max(marks) from school.students
      )
"""
cursor.execute(query)

data = cursor.fetchall()
for i in data:
    print(i)

(3, 'Atif', 2, 100)

# Q.19 Find the minimum marks in the table.

In [73]:
query = """
      select * from school.students
      where marks = ( 
           select min(marks) from school.students
      )
"""
cursor.execute(query)

data = cursor.fetchall()
for i in data:
    print(i)

(7, 'Prikhar', 2, 50)

# Q.20 Find the average marks of all students.

In [77]:
query = """
      select * from school.students
      where marks > (
          select avg(marks
          ) from school.students
      )
"""
cursor.execute(query)

data = cursor.fetchall()
for i in data:
    print(i)

(1, 'shivem', 1, 98)
(2, 'ritem', 1, 95)
(3, 'Atif', 2, 100)
(5, 'noor', 1, 95)
(8, 'bhupas', 3, 96)
(10, 'rajkumar', 3, 98)

# Q.21 Find total marks of all students.

In [84]:
query = "select sum(marks) from school.students"
cursor.execute(query)

data = cursor.fetchall()
for i in data:
    print("All sutudent total marks :",i[0])

All sutudent marks : 859

# Q.22 Count how many students are in each class (use GROUP BY).

In [86]:
query = """
      select classes.class_name, count(student_id) from school.classes
      join school.students
      on students.class_id = classes.class_id
      group by class_name
"""
cursor.execute(query)

data = cursor.fetchall()
for i in data:
    print(i)

('class 6A', 4)
('class 7B', 3)
('class 8C', 3)

# Q.23	Find the highest marks student from each class.

In [97]:
query = """
      select students.student_name, students.marks, classes.class_name
      from school.students
      join school.classes
      on students.class_id = classes.class_id
      where students.marks = (
          select max(students.marks) from school.students
          where students.class_id = classes.class_id
      )
"""
cursor.execute(query)

data = cursor.fetchall()
for i in data:
    print(i)

('shivem', 98, 'class 6A')
('Atif', 100, 'class 7B')
('rajkumar', 98, 'class 8C')

# Q.24 Find the lowest marks student from each class.

In [98]:
query = """
      select students.student_name, students.marks, classes.class_name
      from school.students
      join school.classes
      on students.class_id = classes.class_id
      where students.marks = (
          select min(students.marks) from school.students
          where students.class_id = classes.class_id
      )
"""
cursor.execute(query)

data = cursor.fetchall()
for i in data:
    print(i)

('Asim', 78, 'class 6A')
('Prikhar', 50, 'class 7B')
('Nazem', 81, 'class 8C')

# Q.25 Find the average marks of each class.

In [105]:
query = """
     select classes.class_name, avg(students.marks)
      from school.students
      join school.classes
      on students.class_id = classes.class_id
      group by classes.class_name
"""
cursor.execute(query)

data = cursor.fetchall()
for i in data:
    print(i)

('class 6A', Decimal('91.5000'))
('class 7B', Decimal('72.6667'))
('class 8C', Decimal('91.6667'))

# Q.26	Count number of students in each age group.

In [9]:
query = "select age, count(age) from school.new_table group by age"
cursor.execute(query)

data = cursor.fetchall()
for i in data:
    print(i)

(22, 1)
(21, 2)
(24, 1)
(25, 1)
(26, 1)

# Q.27 Show class where average marks is more than 70.

In [33]:
query = """
      select classes.class_name, avg(students.marks) from school.students
      join school.classes
      on students.class_id = classes.class_id
      group by classes.class_id having avg(students.marks) > 70
"""
cursor.execute(query)

data = cursor.fetchall()
for i in data:
    print(i)

('class 6A', Decimal('91.5000'))
('class 7B', Decimal('72.6667'))
('class 8C', Decimal('91.6667'))

# Q.28 Find students who scored above class average

In [35]:
query = """
      select students.student_name, classes.class_name, students.marks
      from school.students
      join school.classes
        on students.class_id = classes.class_id
      where students.marks > (
         select avg(students.marks) from school.students
      )
 """
cursor.execute(query)

data = cursor.fetchall()
for i in data:
    print(i)

('shivem', 'class 6A', 98)
('ritem', 'class 6A', 95)
('Atif', 'class 7B', 100)
('noor', 'class 6A', 95)
('bhupas', 'class 8C', 96)
('rajkumar', 'class 8C', 98)

# Q.29	Find the second highest marks in the table

In [56]:
# second highest marks first query
query = """
      select * from school.students order by marks desc limit 1 offset 1
"""

# second highest marks second query
# query = """
#       select max(marks) from school.students where marks < (
#          select max(marks) from school.students
#       )
# """
cursor.execute(query)

data = cursor.fetchall()
for i in data:
    print(i)

(1, 'shivem', 1, 98)

# Q.30	Find the top 3 students with highest marks.

In [ ]:
query = "select * from school.students order by marks desc limit 3"
cursor.execute(query)

data = cursor.fetchall()
for i in data:
    print(i)

# Q.31	Show all teachers with their respective classes

In [73]:
query = """
      select * from school.classes
      left join school.teachers
       on teachers.teacher_id = classes.teacher_id
"""
cursor.execute(query)

data = cursor.fetchall()
for i in data:
    print(i)

(1, 'class 6A', 1, 1, 'mohit')
(2, 'class 7B', 2, 2, 'nisant')
(3, 'class 8C', 3, 3, 'dash')

# Q.32	Show teacher names along with student names of their class.

In [75]:
query = """
      select students.student_name, classes.class_name, teachers.teacher_name
      from school.students
      join school.classes
        on students.class_id = classes.class_id
      join school.teachers
        on classes.teacher_id = teachers.teacher_id
"""
cursor.execute(query)

data = cursor.fetchall()
for i in data:
    print(i)

('shivem', 'class 6A', 'mohit')
('ritem', 'class 6A', 'mohit')
('noor', 'class 6A', 'mohit')
('Asim', 'class 6A', 'mohit')
('Atif', 'class 7B', 'nisant')
('Gorab', 'class 7B', 'nisant')
('Prikhar', 'class 7B', 'nisant')
('Nazem', 'class 8C', 'dash')
('bhupas', 'class 8C', 'dash')
('rajkumar', 'class 8C', 'dash')

# Q.33	Find all students with their class teacherâ€™s name

In [77]:
query = """
      select students.student_name, teachers.teacher_name
      from school.students
      join school.classes
        on students.class_id = classes.class_id
      join school.teachers
        on classes.teacher_id = teachers.teacher_id
"""
cursor.execute(query)

data = cursor.fetchall()
for i in data:
    print(i)

('shivem', 'mohit')
('ritem', 'mohit')
('noor', 'mohit')
('Asim', 'mohit')
('Atif', 'nisant')
('Gorab', 'nisant')
('Prikhar', 'nisant')
('Nazem', 'dash')
('bhupas', 'dash')
('rajkumar', 'dash')

# Q.34	Show all classes and number of students in each class.

In [92]:
query = """
      select classes.class_name, count(students.student_id) from school.classes
      join school.students
         on classes.class_id = students.class_id
      group by classes.class_id
"""
cursor.execute(query)

data = cursor.fetchall()
for i in data:
    print(i)

('class 6A', 4)
('class 7B', 3)
('class 8C', 3)

# Q.35	Show teachers who teach more than 1 class.

In [105]:
query = """
      select teachers.teacher_id, teachers.teacher_name, count(classes.class_id) 
      from school.classes
      join school.teachers
        on classes.teacher_id = teachers.teacher_id
      group by teachers.teacher_id, teachers.teacher_name
      having count(classes.class_id) < 1
"""
cursor.execute(query)

data = cursor.fetchall()
for i in data:
    print(i)

# Q.36	Find classes where no teacher is assigned

In [108]:
quert = """
      select classes.class_name from school.classes
      left join school.teachers
      on classes.teacher_id = teachers.teacher_id
      group by classes.class_id
"""
cursor.execute(query)

data = cursor.fetchall()
for i in data:
    print(i)

# Q.37	Find teachers who have students with marks > 90

In [111]:
query = """
      select students.student_id, students.student_name, students.marks, teachers.teacher_name
      from school.students
      join school.classes
        on students.class_id = classes.class_id
      join school.teachers
        on classes.teacher_id = teachers.teacher_id
      where marks > 90
"""
cursor.execute(query)

data = cursor.fetchall()
for i in data:
    print(i)

(1, 'shivem', 98, 'mohit')
(2, 'ritem', 95, 'mohit')
(3, 'Atif', 100, 'nisant')
(5, 'noor', 95, 'mohit')
(8, 'bhupas', 96, 'dash')
(10, 'rajkumar', 98, 'dash')

# Q.38	Show student details along with subject taught by their class teacher

In [ ]:
query = """
      select students.student_id, students.student_name, students.marks, classes.class_name,
      teachers.teacher_name from school.students
      join school.classes
        on students.class_id = classes.class_id
      join school.teachers
        on classes.teacher_id = teachers.teacher_id
"""
cursor.execute(query)

data = cursor.fetchall()
for i in data:
    print(i)

# Q.39	Find the class with maximum students

In [130]:
query = """
      select classes.class_name, count(students.student_id) as total_student from school.classes
      join school.students
        on students.class_id = classes.class_id
      group by classes.class_id order by total_student desc limit 1
"""
cursor.execute(query)

data = cursor.fetchall()
for i in data:
    print(i)

('class 6A', 4)

# Q.40	Find the class with minimum average marks.

In [138]:
query = """
      select classes.class_name, avg(students.marks) as avg_student from school.classes
      join school.students
        on students.class_id = classes.class_id 
      group by classes.class_id 
      order by avg_student asc limit 1
"""
cursor.execute(query)

data = cursor.fetchall()
for i in data:
    print(i)

('class 7B', Decimal('72.6667'))

# Q.41	Show students who scored more than the average marks.

In [140]:
query = """
      select * from school.students where marks > (
          select avg(marks) from school.students
      )
"""
cursor.execute(query)

data = cursor.fetchall()
for i in data:
    print(i)

(1, 'shivem', 1, 98)
(2, 'ritem', 1, 95)
(3, 'Atif', 2, 100)
(5, 'noor', 1, 95)
(8, 'bhupas', 3, 96)
(10, 'rajkumar', 3, 98)

# Q.42 Show students who scored equal to the maximum marks.

In [145]:
query = """
      select * from school.students where marks = (
         select max(marks) from school.students
      )
"""
cursor.execute(query)

data = cursor.fetchall()
for i in data:
    print(i)

(3, 'Atif', 2, 100)

# Q.43 Show students whose marks are greater than all students of class 8C

In [165]:
query = """
      select students.student_id, students.student_name, students.marks, classes.class_name
      from school.students
      join school.classes
      on students.class_id = classes.class_id
      where marks > (
          select max(students.marks) from school.students 
          join school.classes
          on students.class_id = classes.class_id
          where classes.class_name = 'class 8C' 
      )
      
"""
cursor.execute(query)

data = cursor.fetchall()
for i in data:
    print(i)

(3, 'Atif', 100, 'class 7B')

# Q.44	Find students whose age is above average age

In [168]:
query = """
      select * from school.new_table where age > (
          select avg(age) from school.new_table
      )
"""
cursor.execute(query)

data = cursor.fetchall()
for i in data:
    print(i)

(36, 'radhika', 24, 'BSC', 90)
(38, 'rohan', 25, 'BCA', 55)
(39, 'kuldeep', 26, 'MCA', 60)

# Q.45	Show students who are among the top 5 in marks.

In [169]:
query = """
      select * from school.students order by marks desc limit 5
"""
cursor.execute(query)

data = cursor.fetchall()
for i in data:
    print(i)

(3, 'Atif', 2, 100)
(1, 'shivem', 1, 98)
(10, 'rajkumar', 3, 98)
(8, 'bhupas', 3, 96)
(2, 'ritem', 1, 95)

# Q.46	Find duplicate names in students table

In [170]:
query = """
      select student_name, count(*) from school.students group by student_name having count(*) > 1
"""
cursor.execute(query)

data = cursor.fetchall()
for i in data:
    print(i)

# Q.47	Delete duplicate rows (keeping only one)

In [ ]:
# query = """
#       DELETE s1
#       FROM students s1
#       INNER JOIN students s2 
#       WHERE 
#          s1.student_id > s2.student_id
#          AND s1.student_name = s2.student_name
#          AND s1.marks = s2.marks;
# """
# cursor.execute(query)

# data = cursor.fetchall()
# for i in data:
#     print(i)

# Q.48	Update marks of student id=3 to 95

In [173]:
query = "update students set marks = 95 where student_id = 3"
cursor.execute(query)
conn.commit()
print("Successfully update data")

# Q.49	Delete student whose marks are less than 35

In [175]:
query = "delete from students where marks < 35"
cursor.execute(query)

# Q.50	Drop the table students.

In [ ]:
# query = "drop table tableNmae"
# cursor.execute(query)